INSERT INTO PERSON
    (ID, HOURS_DAYS, MIDDLENAME, NAME, NUMBER, PROFESSION, SURNAME, WORK_DAYS, HALF_HOURS_DAYS, HALF_WORK_DAYS)
VALUES
    (nextval('PERSON_SQ'),  32, 'Александровна', 'Наталья', '93-046', 'Инженер 1 кат.', 'Олеговна', 8, 32, 8);

INSERT INTO HOURS_DAYS
    (PERSON_ID, AMOUNT_HOURS_IN_DAY)
VALUES
    (1,  '4'),
    (1,  '4'),
    (1,  '4'),
    (1,  'В'),
    (1,  'В'),
    (1,  '4'),
    (1,  '4'),
    (1,  '4'),
    (1,  '4'),
    (1,  '4'),
    (1,  'В'),
    (1,  'В'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О'),
    (1,  'О');


INSERT INTO TYPE_DAYS
    (PERSON_ID, TYPE_DAYS)
VALUES
       (1,  'Ф'),
       (1,  'Ф'),
       (1,  'Ф'),
       (1,  'В'),
       (1,  'В'),
       (1,  'Ф'),
       (1,  'Ф'),
       (1,  'Ф'),
       (1,  'Ф'),
       (1,  'Ф'),
       (1,  'В'),
       (1,  'В'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О'),
       (1,  'О');

INSERT INTO PERSON
(ID, HOURS_DAYS, MIDDLENAME, NAME, NUMBER, PROFESSION, SURNAME, WORK_DAYS, HALF_HOURS_DAYS, HALF_WORK_DAYS)
VALUES
(nextval('PERSON_SQ'),  12, 'Барабанов', 'Николай', '00-345', 'Специалист по УМР 1 кат.', 'Николаевич', 3, 12, 3);

INSERT INTO HOURS_DAYS
(PERSON_ID, AMOUNT_HOURS_IN_DAY)
VALUES
(2,  '4'),
(2,  '4'),
(2,  '4'),
(2,  'В'),
(2,  'В'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'В'),
(2,  'В'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О');


INSERT INTO TYPE_DAYS
(PERSON_ID, TYPE_DAYS)
VALUES
(2,  'Ф'),
(2,  'Ф'),
(2,  'Ф'),
(2,  'В'),
(2,  'В'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'В'),
(2,  'В'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О'),
(2,  'О');

INSERT INTO PERSON
(ID, HOURS_DAYS, MIDDLENAME, NAME, NUMBER, PROFESSION, SURNAME, WORK_DAYS, HALF_HOURS_DAYS, HALF_WORK_DAYS)
VALUES
(nextval('PERSON_SQ'),  18.4, 'Безменова', 'Алиса', '2019-0177', 'Техник', 'Андреевна', 23, 8.8, 11);

INSERT INTO HOURS_DAYS
(PERSON_ID, AMOUNT_HOURS_IN_DAY)
VALUES
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  'В'),
(3,  'В'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  'В'),
(3,  'В'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  'В'),
(3,  'В'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  'В'),
(3,  'В'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  '4'),
(3,  '4');


INSERT INTO TYPE_DAYS
(PERSON_ID, TYPE_DAYS)
VALUES
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'В'),
(3,  'В'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'В'),
(3,  'В'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'В'),
(3,  'В'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'В'),
(3,  'В'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф'),
(3,  'Ф');